tests/load/artillery.yaml
config:
  target: "https://pckblog.fly.dev"
  phases:
    - duration: 180
      arrivalRate: 10
      rampTo: 500
      name: sustained load

scenarios:
  - name: "Read Post"
    flow:
      - get:
          url: "/post/blog-in-ocaml"
  - name: "List Post"
    flow:
      - get:
          url: "/api/post/"